ajaymathews/microcontroller_tutorials/PIC16F877A_TUTORIALS/TASK/LCD_4BIT.X/newmain.c
/*
 * 
 * File:   newmain.c
 * Author: [Developer]
 *
 * Created on 1 January, 2020, 10:07 AM
 */


#include <xc.h>

#define _XTAL_FREQ 16000000L
#define RS RB0
#define EN RB2
void send_str(char *p);
char timer_value[]="00:00:00";
char ms='0',s='0',m='0';

void cmd_4bit(int x)
{
    PORTB& = 0x0F;
    RS=0;
    EN=0;
    PORTB |= (x & 0xF0);
    EN=1;
    __delay_ms(10);
    EN=0;
    

    
    PORTB& = 0x0F;
    PORTB |= ((x<<4) & 0xF0);
    EN=1;
    __delay_ms(10);
    EN=0;
    
    
}
void lcd_init()
{
	//cmd_2bit(0x33);
	//cmd_2bit(0x32);
	cmd_4bit(0x02);
	cmd_4bit(0x01);
	//cmd_2bit(0x06);
	cmd_4bit(0x0c);
	cmd_4bit(0x80);
}


void data_4bit(char y)
{
    
	PORTB& = 0x0F;//clear already existing data
    RS=1;
    EN=0;
    PORTB |= (y & 0xF0);
    EN=1;
    __delay_ms(10);
    EN=0;
    

    
    PORTB& = 0x0F;
    PORTB |= ((y<<4) & 0xF0);
    EN=1;
    __delay_ms(10);
    EN=0;
    
}
void send_str(char *p)
{
	while(*p!='\0')
	{
		data_4bit(*p);
		p++;
	}
}
void uart_init()
{
	TXSTA=0x24;//0b0010,0100
	RCSTA=0x90;
	SPBRG=103;
}

char receive()
{
	while(!RCIF);
	char b=RCREG;
	return b;
}

void transmit(char b)
{	
	TXREG=b;
	while(!TRMT);
}

void str_transmit(char *p)
{
	while(*p!='\0')
		{
			transmit(*p);
			p++;
	 	}    
}

void str_receive()
{
	char c[15];
	int i;
	for(i=0;i<15;i++)
	{
	c[i]=receive();
	if(c[i]==' ')
	{
		c[i]='\0';
		break;
    }
}
}

void main()
{
	TRISB=0x00;
    T1CON = 0b00110001;
    TRISD1=0; 
    int count=0;
	lcd_init();
    while(1)
    {
     if(count==7)
     {
         ms=ms+1;
         if(ms==100)
         {
             s++;
             if(s==60)
             {
                 m++;
             }
         }
         sprintf(timer_value,"%d:%d:%d",m,s,ms);
                                              
     }
    if(TMR1IF)
    {
     TMR1IF = 0;
     count ++;
     }
 
    }
   
    send_str(timer_value);
    while(1);
         
}
